{"id": 107, "name": "National Tsing Hua University", "membership_type": "Institutional Members - MRC", "membership_status": "Current", "associate_consortium": "TOCWC", "display_name": "National Tsing Hua University", "main_website": "http://www.nthu.edu.tw/", "ocw_website": "http://ocw.nthu.edu.tw/", "description": "National Tsing Hua University is located in Hsinchu, a city 72 kilometers south of Taipei. The campus covers an area of over 105 hectares (260 acres) scenic land with lakes and trees. The campus is conveniently located, neighboring research institutes and universities such as the Industrial Technology Research Institute (ITRI), Synchrotron Radiation Center (SRC), National Center for High-Performance Computing (NCHC), Food industry Research and Development Institute (FIRDI), National Chiao Tung University (NCTU), Chung-Hua University (CHU), National Hsin-Chu Teachers College (NHCTC) and the Hsinchu Science-Based Industrial Park (HSIP). These establishments have made Hsinchu known as 'Science city of Taiwan'. \r\n\r\nThere are now 7 colleges, 17 departments and 18 independent institutes in Tsing Hua, including the College of Science, Engineering, Nuclear Science, Humanities and Social Sciences, Life Science, Electrical Engineering and Computer Science and the College of Technology Management. There is, moreover, a Commission for General Education charged with supervising the common distribution curricula for the entire university. There are over 500 full-time faculty professors. And there are more than eight thousand five hundred students, with some 4700 undergraduates, some 2600 candidates for the master's degree, and about 1200 for doctor's degree. Student-faculty ratio stands about 17:1, and that of male to female students is about 3:1. \r\n\r\nIn teaching, as in search, the University emphasizes interdisciplinary co operations. Besides maintaining basic standards, undergraduate curricula are designed to maximize flexibility as well as systematization. To break out of departmental confines, the University designs curricula with courses that transcend collegiate and departmental boundaries. \r\n\r\nMoreover, to enhance humanistic and spiritual cultivation, the University offers common distribution courses in general education and has an Arts Center that makes significant contributions to art activities on campus. \r\n\r\nTo encourage teaching and research among faculty, the University established prizes for outstanding teachers as well as visiting chair professorships for outstanding international scholars. Laboratory equipments, facilities of the library, the computer and communications center, too, are continuously upgraded for ever-improved student utilization.", "logo_small": "logos/200px-NTHU-logo3_c5b592b51895593335cfbc7048909a3a.png", "logo_small_url": "http://www.ocwconsortium.org/media/logos/200px-NTHU-logo3_c5b592b51895593335cfbc7048909a3a.png"}