{"id": 14, "name": "Universidad Icesi", "membership_type": "Institutional Members - DC - MRC", "membership_status": "Current", "associate_consortium": "UNIVERSIA", "display_name": "Universidad Icesi", "main_website": "http://www.icesi.edu.co/", "ocw_website": "http://www.icesi.edu.co/ocw", "description": "La Universidad Icesi es una entidad privada sin ánimo de lucro, fundada en 1979 por un grupo de líderes empresariales del Valle del Cauca, para formar profesionales de excelencia, con un alto sentido ético y social, en las diversas áreas del conocimiento. \r\nHoy se ofrecen dieciseis programas de pregrado, una maestría en Administración con doble titulación con la Universidad de Tulane en Estados Unidos, una maestría en Administración con énfasis en Gestión Estratégica, Finanzas Corporativas, Negocios Internacionales, Gestión de la Salud, Mercadeo y Gestión Humana, una maestría en Finanzas en convenio con el Illinois Institute of Technology y diez programas de especialización. Gracias al estrecho vínculo de la Universidad con las empresas y para satisfacer sus solicitudes de actualización, se diseñan diplomados y programas a la medida de sus necesidades y se ofrece a las organizaciones, asesorí­a y consultoría. \r\nCuenta con un excelente grupo de profesores de tiempo completo y dedicación exclusiva, quienes se caracterizan por su avanzada formación académica, por su habilidad para la docencia y por su experiencia profesional. El 41% de los profesores de tiempo completo tienen tí­tulo de doctorado, o está en curso, el 34% tiene título de Maestría, el 19% de Especialista y el 8% es profesional. También cuenta con un excelente grupo de profesores de hora cátedra. Ellos son guías y diseñadores de experiencias educativas que maximizan los distintos procesos de enseñanza, aprendizaje e investigación. \r\nDesde sus inicios la Universidad apoya y fomenta la investigación en profesores y estudiantes. Hoy cuenta con 14 grupos de investigación inscritos en Colciencias, de los cuales 8 están clasificados en las categorí­as de máximo reconocimiento. \r\nTodos los programas de pregrado y de postgrado cuentan con la aprobación del Ministerio de Educación Nacional, con el respaldo y la seriedad institucionales y con el apoyo de las empresas que fundaron y continúan soportando este esfuerzo del Valle del Cauca, para Colombia y para el mundo.", "logo_small": "logos/icesi200_4a82a8b17dfb71b497e4a5cd05faadab.jpg", "logo_small_url": "http://www.ocwconsortium.org/media/logos/icesi200_4a82a8b17dfb71b497e4a5cd05faadab.jpg"}