{"id": 321, "name": "Hanyang University", "membership_type": "Institutional Members - MRC", "membership_status": "Current", "associate_consortium": "", "display_name": "Hanyang University", "main_website": "http://hanyangocw.hanyang.ac.kr/class", "ocw_website": "http://hanyangocw.hanyang.ac.kr/class", "description": "Hanyang University took its first step as Dong-A Engineering Institute on July 1st, 1939. It was the period in which the Japanese were making frantic efforts in pursuing their extensive policies to liquidate all of Korean history and heritage and assimilate them into that of the Japanese. Baik Nam, Lyun Joon Kim, the founder of Hanyang University established Dong-A Institute based on the strong conviction that the education, specifically education in technology, would be the only way to restore Korea and to pave the way for the advancement of the nation. Under this belief, Dong-A institute started with 630 students and a faculty of 13 professors and 22 instructors in Jongno-gu, Seoul. After producing its first graduates in 1941, Dong-A tried to elevate itself to college status, with no avail. In May 1941, the Institute moved to where Pearson Biblical Seminary was located and offered education specializing in engineering and technology to 100 students who had finished secondary school. In 1943, still under Japanese occupation, the Institute was suspended from recruiting new students, which resulted in a temporary shut-down of the school on March 15, 1944, when the last 78 students graduated.  \r\nUpon the restoration of the nation's independence in August 1945, Dong-A Institute renamed itself the Engineering Institute for National Foundation and settled at 251 Shindang-dong, Seoul. Having fostered numerous engineers in the storm of upheaval since the nation's independence, Dr. Lyun Joon Kim, the founder, foresaw the importance of industrial advancement in the reconstruction of Korea, and contributed by establishing Hanyang as a judicial and academic body. The board of trustees at that time included Myowook Lee, Byeongok Cho, Kwansoo Baik, Wonchul Lee, Waljoon Kim, Taeyong Choi, and Lyunjoon Kim, who had led the nation's independence movement. Inspired by the strong support of the foundation, the Institute was upgraded to the nation's first four year Engineering College, being approved by the Ministry of Education of the Interim Government, and they elected Dr. Lyunjoon Kim as the first Dean. Six departments were set up including Electrical, Mechanical, and Civil Engineering, Architecture, Chemical, and Mining as well as an Engineering High School and a middle school.  \r\nAlthough during the Korean War, many of the schools facilities were destroyed and the professors and students were scattered all over classes were continued in Busan with temporary teachers. However, even during their refuge, the College fostered numerous competent science teachers by building a training center for secondary school teachers in the technical fields. In 1953, it was authorized as a graduate school by the Ministry of Education. The building was restored in Haengdang-dong, Seongdong-gu, Seoul and it is still the current address of Hanyang University.  \r\nHanyang University formed the university foundation in March, 1959 and Mr. Lyun-joon Kim was inaugurated as the first President. The University started with 19 departments in 3 colleges (the College of Engineering, the College of Liberal Arts and Science and the College of Politics and Economy) and 6 departments offering evening courses.  \r\nAs the University has expanded its size, the Colleges of Music, Physical Education and Education were newly established. By adding the College of Medicine, 46 departments of 7 colleges and 9 departments offering night courses were established. Hanyang University Medical Center was established in 1972 with Ansan Campus in the new industrial city near Seoul at the same time.  \r\nBased on such history and tradition, the University is trying to continually evolve itself in order to foster the competent leaders required in the 21st century. In 2001, the University set up HY Dream 2010, with the vision of becoming a cradle to foster leaders in the new millennium. The Plan has been implemented to be born again as HYU Project 2010. Based on this objective, all of Hanyang's community members are giving their best to accomplish the goal of nurturing Global i-leader.  \r\nHanyang University began as the nation's first private College of Engineering, producing numerous specialists who have worked as the backbone of the nation's industrialization and modernization. Now, it is arising as a new model of an educational System for the 21st century. Hanyangians treasure their history and traditions and are spreading their wings to design a better future. Celebrating its 67th anniversary, Hanyang University is setting its firm step towards advancing into one of the most prestigious universities of Korea and in the world.", "logo_small": "", "logo_small_url": "http://www.ocwconsortium.org/media/"}