{"id": 419, "name": "TPED - Thomas Edison Grants Program Consortium", "membership_type": "Associate Consortium Members", "membership_status": "Current", "associate_consortium": "", "display_name": "TPED - Thomas Edison Grants Program Consortium", "main_website": "http://www.thomasedisonprogram.org", "ocw_website": "", "description": "Thomas Edison Program for Environmental and E-Learning Development (TPED) is aimed at funding sustainability programs and education in developing countries including green environment research, support adaption of e-learning to reduce paper books and fund deployment of energy saving equipment or equipment that use alternate energy sources.  The program is now extended to cover language learning, provide basic amenities to rural schools and women training centers. The program also covers various research activities in Universities and Higher Education Colleges. \r\n\r\nThe main objectives of the program are:\r\n\r\n(a)\tPromote Girl Child Education in developing countries\r\n(b)\tProvide research grants to Higher Education Colleges in environmental research, research for the betterment of health & hygiene in rural communities\r\n(c)\tPromote green environment  and sustainability education\r\n(d)\tProvide equipment and tools for teacher training in developing countries\r\n(e)\tProvide Digital Library and e-kids corner equipment to public libraries; provide EKC (Einstein Kids Corner) equipment to rural schools that promote adoption and adaptation of open educational materials\r\n(f)\tProvide Digital Library equipment to higher education colleges to promote adoption and adaptation of open educational materials around the world (This equipment has comprehensive Unified Library Appliances with NVD Jukebox, Streaming Server etc. The setup consumes 40% less power compared to traditional implementations). Digital Viewers are also given to the library\r\n(g)\tPromote Adult Education through multimedia hand-held devices\r\n(h)\tProvide Digital Classroom equipment to schools and colleges and provide Digital Studio equipment to Faculty to promote opencourseware \r\n(i)\tProvide education tools to self help women groups, slum kids and health workers (AIDS control etc) \r\n\r\nTPED OCW consortium consists of Institutions that have been provided funds to promote open learning programs across the globe. Members include top of the line educational & research institutions that provide quality education and promote technological & scientific research. These institutions have trained scientists and engineers who have contributed to game changing technologies.", "logo_small": "logos/TPED LOGO_5e82aade0af18906193788f6cace6cd0.jpg", "logo_small_url": "http://www.ocwconsortium.org/media/logos/TPED LOGO_5e82aade0af18906193788f6cace6cd0.jpg"}