{"id": 432, "name": "African Virtual University", "membership_type": "Associate Consortium Members", "membership_status": "Sustaining", "associate_consortium": "", "display_name": "African Virtual University", "main_website": "http://www.avu.org", "ocw_website": "http://oer.avu.org", "description": "The African Virtual University (AVU) is a Pan African Intergovernmental Organization established by charter with the mandate of significantly increasing access to quality higher education and training through the innovative use of information communication technologies.  \r\nThe AVU has trained more than 40,000 students since inception in 1997. The greatest asset of the AVU is its ability to work across borders and language barriers in Anglophone, Francophone and Lusophone Africa.\r\n\r\nAs the leading Pan African eLearning Network, the AVU has acquired the largest eLearning network in Anglophone, Francophone and Lusophone Africa with more than 53 Partner Institutions in 27 countries.\r\n\r\nThe AVU has its headquarters in Nairobi, Kenya and a Regional office in Dakar Senegal.  The AVU has Host Country Agreements with the governments of Kenya and Senegal and the AVU has diplomatic status in these countries.\r\nVision\r\n\"To be the Leading Pan-African Open, Distance and eLearning Network\"\r\nMission \r\n\"To facilitate the use of effective Open, Distance and eLearning in African institutions of tertiary education\"\r\n \r\nStrategic Objectives\r\n1.\tIncrease access to tertiary and continuing  education in Africa by reaching large numbers of students and professionals in multiple sites simultaneously\r\n2.\tTo increase  access to  higher quality Open, Distance  and  eLearning (ODeL) resources  that are     relevant to Africa\r\n3.\tTo enhance the capacity of African tertiary educational institutions\r\n4.\tTo enhance and sustain a network of Partner Institutions\r\n5.\tTo build and sustain  partnerships with institutions that can support the African Virtual University           Mission\r\n6.\tTo carry out research and evaluation activities on the African Continent\r\n7.\tTo build and sustain a committed and effective African Virtual University organization\r\n8.\tTo develop and implement a fund raising strategy in support of all of the above objectives with focus on African Governments, the Private Sector and International Organizations", "logo_small": "", "logo_small_url": "http://www.ocwconsortium.org/media/"}