{"id": 467, "name": "SUNGKYUNKWAN UNIVERSITY", "membership_type": "Institutional Members - MRC", "membership_status": "Current", "associate_consortium": "KOCWC", "display_name": "SUNGKYUNKWAN UNIVERSITY", "main_website": "http://www.skku.edu/new_home/eng/index_pc.jsp", "ocw_website": "http://www.icampus.ac.kr", "description": "Sungkyunkwan University was founded in 1398 as the highest national educational institute in the early years of the Joseon Dynasty in Korea. As the oldest university in East Asia, it has fostered leaders of our society for over 600 years. '수기치인 (修己治人),' pronounced as 'Su-Gi-Chi-In,' SKKU's main ideology, teaches that SKKU students strive to perfect themselves as leader and contribute to our society. This ideology is the fundamental principle by which SKKU brought up leaders of our society for over 600 years, thus contributing to evolution of our society. SKKU aims to educate future global leaders equipped with this ideology so that it will further contribute to the international society. Sungkyunkwan University, under the catch-phrase 'Unique Origin Unique Future,' continuously pursues to integrate its foundation philosophy with the modern technology with a view to cultivating global talents who will lead the 21st century. \r\n\r\nOld Sungkyunkwan was founded over 600 years ago by royal decree to promote the scholarship in Confucianism. As a nation's highest educational institution, Old Sungkyunkwan went through vicissitudes with the country it served over the centuries. Though a long history alone cannot guarantee the excellence of an institution, the rich culture, which exudes from a long tradition, is surely a unique and valuable asset of the University. It would be misleading, however, to view the University merely in the context of its pre-modern history. \r\n\r\nWhat the University has achieved in the past fifty years meets and exceeds that of the preceding five hundred and fifty years. We take pride in the University's innovative spirit; as a result of the long efforts to place natural sciences on an equal footing with our strong foundation in humanities, we now operate two campuses: the Humanities and Social Sciences Campus and the Natural Sciences Campus. Based on a highly successful partnership with Samsung which has generously funded several core initiatives, the University has been rapidly developing and prospering since 1996.", "logo_small": "logos/Logotype_06-1_47dbe5208be3848d3bb621595eb50cd3.jpg", "logo_small_url": "http://www.ocwconsortium.org/media/logos/Logotype_06-1_47dbe5208be3848d3bb621595eb50cd3.jpg"}