{"id": 480, "name": "National Taiwan University", "membership_type": "Institutional Members - MRC", "membership_status": "Current", "associate_consortium": "TOCWC", "display_name": "National Taiwan University", "main_website": "http://www.ntu.edu.tw/", "ocw_website": "http://ocw.aca.ntu.edu.tw/", "description": "NTU's institutional predecessor was Taihoku Imperial University, founded in 1928 by the Japanese colonial administration. The first president was Shidehara Tan Tairaka Hiroshi. In 1945, the Republic of China won the war of resistance against Japan, and Taiwan was handed over to the Nationalist government of China. On November 15 of that year, Taihoku Imperial University was formally transferred to Chinese administration and renamed as National Taiwan University, with Dr. Tsung-lo Lo appointed as the first President. \r\n\r\n      During the Japanese occupation, the University consisted of two academic divisions: the Literature and Politics division and the Science and Agriculture division, with about 60 students enrolled each semester. The Medical division was added in 1936, followed by the Engineering division in 1943. Additionally, the University included the affiliated Agriculture and Forestry division, the affiliated Medical special division, a Tropical Medicine research institute and a preparatory school. Also, in 1943 the Southern Humanities research institute and the Southern Resource research institute were added. At that time, each division operated according to the lecture system, with a full-time Professor in charge of a faculty of associate professors, lecturers, teaching assistants and staff. These divisions and institutes were financially independent and had their own libraries. By 1945, the university expanded to five divisions, including Literature and Politics, Science, Agriculture, Medicine and Engineering, with a total enrollment of 382 students. \r\n\r\n      After restructuring in accordance with the ROC academic system in 1945, academic departments were established and the former divisions were renamed Colleges. The Literature and Politics division was divided into the College of Liberal Arts and the College of Law. Additionally, colleges of Science, Medicine, Engineering and Agriculture were established. Initially, there were six colleges with 22 departments. In 1945, student enrollment was 585. In the following years, the departments and colleges expanded in faculty and hardware in step with growing budgets and rising social expectations. In 1960, the night school was initiated on a trial basis, and in 1967 a new night school was established. In 1987, the College of Management was established, followed by the College of Public Health in 1993 and the College of Electrical Engineering in 1997. The College of Electrical Engineering was later rechristened the College of Computer Science and Electrical Engineering; in 1999, the College of Law was renamed the College of Social Sciences, and the Night Division and the Center for Continuing Education were combined to form the School for Professional and Continuing Studies. In 2002, the College of Agriculture was renamed the College of Bio-resources and Agriculture, and in 2002 a College of Life Sciences was added. Now, the university has 11 colleges, with 54 departments and 103 graduate institutes, plus four university-level research centers: Population and Gender Studies Center, Center for Condensed Matter Sciences, Center for Biotechnology, and Bio-diversity Research Center. The total number of students, including those enrolled at the School of Professional and Continuing Studies, has grown to over 33,000, including over 17,000 university students and 15,000 graduate students. Now, the number of graduate students at NTU almost equals the number of university students, which indicates that NTU has successfully been transformed into a research university.", "logo_small": "logos/NTU_c0b00026195d22b55c6beb9235498ab6.gif", "logo_small_url": "http://www.ocwconsortium.org/media/logos/NTU_c0b00026195d22b55c6beb9235498ab6.gif"}