{"id": 481, "name": "National Chung Hsing University", "membership_type": "Institutional Members - MRC", "membership_status": "Current", "associate_consortium": "TOCWC", "display_name": "National Chung Hsing University", "main_website": "http://www.nchu.edu.tw", "ocw_website": "http://140.120.2.227/nchu_oc/OCW/index.php", "description": "National Chung Hsing University has undergone a number of significant stages of change. It began as the Advanced Academy of Agronomy and Forestry, founded by the Japanese in Taipei in 1919. After 1928, the Academy became a special department affiliated to Taihoku Imperial University (now National Taiwan University). However, the department became an independent school again in 1943, and was moved to Taichung.\r\n\r\nAfter the Restoration of Taiwan in 1945, the school was reorganized and renamed Taiwan Provincial Taichung Agricultural Junior College. In 1946, the Junior College evolved into a higher institution, Taiwan Provincial College of Agriculture. Then in 1961, it combined with the newly-established College of Science and Engineering on the same Taichung campus and the College of Law and Business founded in Taipei in 1949, to become Taiwan Provincial Chung Hsing University. In 1964, an Evening School was set up on the Taipei Campus. In 1968 another Evening School and the College of Liberal Arts were added to the Taichung Campus. The University continued to grow in size, and in 1971 it became a national university, and assumed its present name: National Chung Hsing University (NCHU).\r\n\r\nThe College of Veterinary Medicine was established in September 1999. In February 2000, the Taipei Campus including the College of Law & Business and Taipei Evening School was combined into the newly established National Taipei University. The College of Social Sciences & Management was established on Taichung Campus at the same time. In August 2002, the Extension Division and the Extension Education Center were combined into the Extension Division for In-service and Continuing Education.", "logo_small": "logos/NCHU_ba09f724eb4ad1f136182ce61d3baf70.jpg", "logo_small_url": "http://www.ocwconsortium.org/media/logos/NCHU_ba09f724eb4ad1f136182ce61d3baf70.jpg"}