{"id": 483, "name": "National Hsinchu University of Education", "membership_type": "Institutional Members - MRC", "membership_status": "Current", "associate_consortium": "TOCWC", "display_name": "National Hsinchu University of Education", "main_website": "http://www.nhcue.edu.tw/", "ocw_website": "http://talk.tlc.nhcue.edu.tw/OCW", "description": "Our university was founded in April, 1940, got the name of National Hsinchu Teachers College in 1987 and finally got the name of National Hsinchu University of Education in 2005. In order to meet the needs of the current situation and future development direction, our university comprises colleges of education, science, and liberal arts.\r\n\r\n【Educational Purposes】\r\n-Be engaged in academic research and serve the country and society.\r\n-Prepare teachers for elementary education, preschool education and special education.\r\n-Cultivate various specialties for the cultural and educational field.\r\n\r\n【Educational Targets】\r\n-To extend the senses of cultural awareness, the dedicated devotions to the country and the society.\r\n-To cultivate each individual as the whole person with mental and physical health.\r\n-To provide comprehensive knowledge of humanities, arts and sciences.\r\n-To equip with professionalism.\r\n-To acaquire the creativity and capability of doing research.\r\n\r\n【Characteristics】\r\n◆ University with Characteristics of Culture and Education \r\n　 Our university has always been an important organization preparing teachers for elementary education, preschool education and special education in Taiwan. In recent years, with decreasing demand for teachers, training for teachers in our university gradually becomes more sophisticated. Continuing to maintain the leading position in teacher training, making the best use of our advantage in cultural education and art, our university shall be developed as a unique organization with a core of culture, art and education within the area of Taoyuan, Hsinchu and Miaoli. \r\n\r\n◆ Fine Interaction with Community \r\n　 Over 70% of teachers, directors, and principles of elementary schools within the area of Taoyuan, Hsinchu and Miaoli are alumni of our university. By communicating with alumni and schools of this counseling area actively, National Hsinchu University of Education provides services including guidance, speech, counseling, etc. and assists the development and growth of elementary education. In addition, the National Hsinchu University of Education makes efforts to cooperate with enterprises to provide community service such as cooperation with electronics foundation, long-term counseling for children of disadvantaged families in the Hsiang Shan area, music and art exhibition, teaching camp jointly held with Quanta Education Foundation, etc. Other community service includes regular children’s science camp, maths camp, art camp, swimming class, etc. We plan to add a homework school in elementary school and organizations providing more professional, convenient and safe education for residents of the community.", "logo_small": "logos/NHUE_90d606d12c6595e67f458bdc9e66cc81.jpg", "logo_small_url": "http://www.ocwconsortium.org/media/logos/NHUE_90d606d12c6595e67f458bdc9e66cc81.jpg"}