{"id": 484, "name": "National Dong Hwa University", "membership_type": "Institutional Members - MRC", "membership_status": "Current", "associate_consortium": "TOCWC", "display_name": "National Dong Hwa University", "main_website": "http://www.ndhu.edu.tw", "ocw_website": "http://opencourse.ndhu.edu.tw/moodle/", "description": "National Dong Hwa University was founded in July 1994 with the planning stage started three years earlier. \r\n\r\nIn October 1991, the National Dong Hwa University Planning Office was established in Shoufeng, Hualien, by the Ministry of Education as part of its mission to foster the balanced regional development of Taiwan through the even distribution of higher education systems in the north, south, east and west of the island. Professor Paul Tzung-Tsan Mu was appointed to head the Office and led the development of plans for eastern Taiwan's first comprehensive university. \r\n\r\nOn July 1, 1994, National Dong Hwa University was formally inaugurated with Professor Mu serving as its founding President. After seven years of vigorous and unflagging commitment, Professor Mu resigned his administrative duties at the University in the summer of 2001. By then, National Dong Hwa University was established with four colleges, namely the College of Humanities and Social Sciences, the College of Sciences and Engineering, the College of Management, and the College of Indigenous Studies. \r\n\r\nThe College of Indigenous Studies was founded in August 2001. Being the first aboriginal school on ethnic studies in Taiwan, the College of Indigenous Studies was established with the mission of universalizing and internationalizing ethnicity issues, and serving as an epicenter for Taiwanese ethnic and Austronesian research. \r\n\r\nOn January 23, 2002, Professor Wen-Shu Hwang, who shared Professor Mu's mission of transforming a series of humble sugarcane fields into a distinguished university since the very beginning, was elected to serve as Professor Mu's successor. Under Professor Hwang's innovative leadership, the University continued to strive for excellent teaching, research and community outreach. \r\n\r\nIn 2004, the College of Marine Science was established in Pingtung as the fifth college of National Dong Hwa University. The establishment of the College was a pioneering act in Taiwan by combining the resources and expertise of a university and a prestigious museum, the National Museum of Marine Biology and Aquarium.", "logo_small": "logos/NDHU_a63d0f806e5f4c566c4fb71d93e716a5.jpg", "logo_small_url": "http://www.ocwconsortium.org/media/logos/NDHU_a63d0f806e5f4c566c4fb71d93e716a5.jpg"}