{"id": 485, "name": "Kaohsiung Medical University", "membership_type": "Institutional Members - MRC", "membership_status": "Current", "associate_consortium": "TOCWC", "display_name": "Kaohsiung Medical University", "main_website": "http://www2.kmu.edu.tw", "ocw_website": "http://ocw.kmu.edu.tw/", "description": "Kaohsiung Medical University (originally known as Kaohsiung Medical College ) was formally established in 1954. Apart from being the first private medical university in , the university has also become an important cradle for highly-skilled physicians and medical-related specialists. \r\n\r\n\r\n \r\n\r\n\r\nKaohsiung Medical University was a center of both medical care and the study of local tropical medicine in the early days. The colleges set aside its tropical disease research mission after the World Health Organization announced that was no longer a tropical disease endemic area, and turned its full attention to the steadily evolving areas of basic medical science and clinical medical research. The university has also continued to strengthen its medical services. Kaohsiung Medical University therefore has laid a solid foundation as southern 's leading medical institution. \r\n\r\n\r\n \r\n\r\n\r\nAfter Kaohsiung Medical College became a university in the summer of 1999, it seized this opportunity to move faster and further and attain to the highest standards in teaching, research and service. The shared vision of everyone at Kaohsiung Medical University is to make the university a modern, forward-looking institution striving for excellence in both academics and medical care. \r\n\r\n\r\n \r\n\r\n\r\nKaohsiung Medical University has all the strengths of a well-established university. There is a wide range of medical related courses, and the facilities both for basic and clinical research are sufficient and of a good quality. The University is located in city center of Kaohsiung, the second biggest city in , which has all the attractions and excitement of city life.", "logo_small": "logos/KMU_35a0eb5ab50854a0fca6b2bb7e47b891.jpg", "logo_small_url": "http://www.ocwconsortium.org/media/logos/KMU_35a0eb5ab50854a0fca6b2bb7e47b891.jpg"}