{"id": 486, "name": "National Taiwan Ocean University", "membership_type": "Institutional Members - MRC", "membership_status": "Current", "associate_consortium": "TOCWC", "display_name": "National Taiwan Ocean University", "main_website": "http://www.ntou.edu.tw/", "ocw_website": "http://moodle.ntou.edu.tw/course/category.php?id=470", "description": "National Taiwan Ocean University (NTOU) was established in 1953 as Provincial Taiwan Maritime Technology College. Eleven years later, in 1964, we became a maritime college that offered bachelor's and master's degrees in various maritime fields. During this period, the college was supported by the Taiwan Provincial Government of the Republic of China. In 1979, we became a national institution, and were renamed the National Taiwan College of Marine Science and Technology. A decade later, in 1989, the college became a full-fledged university. \r\n\r\nAt present, NTOU has six colleges - Maritime Science and Management, Life Sciences, Ocean Science and Resource, Engineering, Electrical Engineering and Computer Science, as well as Humanities and Social Sciences. These Colleges house a total of 28 undergraduate departments and graduate institutes. \r\n\r\nAs we look at the progress over the last 52 years, the University has undergone great growth and change and is now recognized as one of the nation's most important centers of learning and scholarship, especially in the marine sciences and maritime studies. \r\n\r\nResponding to the changing needs of society and the widening interests of our students, we are developing into a comprehensive university with a unique maritime focus. We aim to be an internationally known institution of higher education. Toward this end, our social sciences and liberal arts programs are developing as a core part of education at NTOU. The University is rapidly moving toward providing a positive learning environment and culture for intellectual and personal growth, with ocean interests as our unique characteristic.", "logo_small": "logos/NOU_e6385b00471706cf4e2ddd9b76041d25.gif", "logo_small_url": "http://www.ocwconsortium.org/media/logos/NOU_e6385b00471706cf4e2ddd9b76041d25.gif"}