{"id": 488, "name": "Southern Taiwan University", "membership_type": "Institutional Members - MRC", "membership_status": "Current", "associate_consortium": "TOCWC", "display_name": "Southern Taiwan University", "main_website": "http://www.stut.edu.tw/", "ocw_website": "http://ocw.stut.edu.tw/", "description": "“Willing to educate qualified students” and “benefiting society and adding to the development of our nation” are lyrics that appear in STUT’s school song, and they were the purposes for establishing this university. The mission of STUT is to pursue academic excellence in both technological fields and in the humanities.\r\n\r\nDuring the past 40 years, with the board of directors and tens of thousands of teachers and students working together, STUT has grown and developed. We are now undoubtedly the leader of private universities of technology in Taiwan.\r\n\r\nWe seek to achieve the following in order to become the top international private university of technology: Conduct research, be innovative, and pursue excellence,\r\n\r\n•Integrate local resources and increase the opportunities for cooperation between industry and academia in order to develop regional advantages.\r\n•Recruit outstanding teachers in order to develop major technology and secure national funding.\r\n•Develop a diversified learning curriculum which equally emphasizes both the technological sciences and the humanities; thus, graduating students who are not only well trained and highly qualified but are also upright citizens.\r\n•Create international partnerships with other universities with a focus on both going out into the world and in bringing the world to us.\r\n•Construct and further enhance teaching, learning, and research facilities.\r\n•Build a free and open education system that focuses on the whole person by promoting creativity, discipline, and cultural-literacy, as well as instill in our students a quest for knowledge that extends into life-long learning.\r\n•Create a sound financial system while actively seeking external funding from the government and enterprises to help support the development of our university.\r\n•Build a global alumni organization, so that with alumni support the university can continue to move forward.\r\n•With an eye to the future, create new channels for student recruitment increasing both the quality and the quantity of students pursuing degrees at our university.", "logo_small": "logos/STU_e35ea91387962a2ba32b9354f238ebde.gif", "logo_small_url": "http://www.ocwconsortium.org/media/logos/STU_e35ea91387962a2ba32b9354f238ebde.gif"}