{"id": 489, "name": "Hungkuang University", "membership_type": "Institutional Members - MRC", "membership_status": "Current", "associate_consortium": "TOCWC", "display_name": "Hungkuang University", "main_website": "http://www.hk.edu.tw/", "ocw_website": "", "description": "Recognizing the importance of nursing quality in providing medical treatment, Dr. Yui Lin Wang, a distinguished medical doctor, declared his intention to establish a system of practical education with the purpose of training qualified nurse technicians. Dr. Wang worked closely with the Ministry of Education to found the Hungkuang Junior College of Nursing on July 7, 1967 and served as president of the institution until he passed away in 1987. \r\n　　In November of 1987, Dr. Nai Phon Wang, MD, served as the second president of Hungkuang Junior College of Nursing. The school soon expanded into a four-year college of nursing by the month July of 1997 and flourished as a result of the hard work and dedication of the students, faculty, and administration.Several years later, in February of 2003, Hungkuang became a university with fourteen departments and three graduate programs.  \r\n \r\n \r\n　　\r\nOur mission is to foster a challenging and valuable learning environment for all students at Hungkuang University.Under the guidance of our current president, Dr. kuo Chuan Fang, the university will continue to follow its developmental plans which include, not limited to the expansion of the school’s educational district, development of its teaching facilities, recruitment of additional qualified faculty, addition of library facilities, establishment of new departments, constant reflection and reorganization of our collegiate system, and promotion of international academic exchange. With our philosophy of whole-person education and our dedication to constant self refection, Hungkuang University will continue its position as an esteemed university within Central Taiwan, and soon become a respectable international university as well.", "logo_small": "logos/HU_974e34b2e6aacd86ad042b728a7c5682.jpg", "logo_small_url": "http://www.ocwconsortium.org/media/logos/HU_974e34b2e6aacd86ad042b728a7c5682.jpg"}