{"id": 490, "name": "The  Research Council of Oman", "membership_type": "Associate Consortium Members", "membership_status": "Current", "associate_consortium": "", "display_name": "The  Research Council of Oman", "main_website": "http://www.trc.gov.om", "ocw_website": "", "description": "The Research Council of the Sultanate of Oman is both a policy-making institution and a funding agency. The Council supports research and education related activities across all the institutions in the Sultanate. The role of the Research council includes:\r\n\r\n(i) Promoting scientific inquiry and disseminating scientific knowledge, and nurturing people with research talents and abilities and creating new techniques and methods that assist in propelling the wheel of social and economic development and improving living standards;\r\n\r\n(ii) Fostering researchers and encouraging them by offering them all financial, material and moral support; Introducing the private sector to various investment activities that can be done in the field of science and technology and providing these investors with the necessary scientific research services;\r\n\r\n(iii) Building research capacities through supporting research chairs and establishing scientific research centers; and Spreading awareness among the people through the media on the important role of science, technology, innovation and creativity on achieving sustainable development. \r\n\r\nThe Research Council of Oman carries tasks related to research and endeavors to promote and support research using all the material and moral means possible.\r\n\r\nThe Research Council in this capacity is the main national authority in this area, acts as a focal point for research and innovation and liaise with various institutions concerned with research.\r\n\r\nThe Council is the sole reference body in these matters in Oman and is entrusted with the responsibility of coordination between various organizations engaged in research activities. In particular, the Research Council has been mandated to:\r\n\r\n(a) Formulate a strategy with a nationally integrated plan for research and monitor its development.\r\n\r\n(b) Identify national research priorities.\r\n\r\n(c) Develop one or more programs to implement the identified national research  priorities as per the plan and supervise the implementation of these programs.\r\n\r\n(d) Publicize the national research plan and its priorities with the objective of promoting  research activities.\r\n\r\n(e) Support individual innovation and research programs in accordance with national research priorities.\r\n\r\n(f) Support scientific publication.\r\n\r\n(g) Provide educational resources.\r\n\r\n(h) Discuss the research budget allocation and the proposed distribution among the various institutions before inclusion in the national annual budget.\r\n\r\nThe Research Council of Oman works with other grants programs like TPED to develop education in the region.", "logo_small": "logos/Oman TRC Logo_c5bd4a4eecac3b880f6e689fb7ae115c.jpg", "logo_small_url": "http://www.ocwconsortium.org/media/logos/Oman TRC Logo_c5bd4a4eecac3b880f6e689fb7ae115c.jpg"}