{"id": 491, "name": "Kun Shan University", "membership_type": "Institutional Members - MRC", "membership_status": "Current", "associate_consortium": "TOCWC", "display_name": "Kun Shan University", "main_website": "http://www.ksu.edu.tw/", "ocw_website": "http://ocw.ksu.edu.tw/", "description": "Kun Shan University was officially founded on April 29, 1965, known as Kun Shan Institute of Technology. It is located on Da Wan Road, Yung Kang city in Tainan County on a beautiful and spacious campus including a quaint shimmering pond, a combination of ancient Chinese and modern structures and is home to a nine cornered bridge, pavilions, flowers and trees.\r\n\r\nIn August 2000, Kun Shan Institute of Technology was promoted by the Ministry of Education to a technological university. Many new facilities have been constructed on campus, such as laboratories, audio-visual classrooms, faculty research rooms, and discussion rooms to provide both students and faculty a positive environment to study and do research. \r\n\r\nOriginally, it was an industrial junior college, then afterwards it was changed to a junior college of industry and business. Due to its achievements in offering high quality education, of more than ten junior colleges the school was the first one of its kind to be promoted a college of technology, and then finally once again promoted to the status of a university of technology. The various stages of this transformation have closely kept up with the changes in the country's key stages of development that demand a pool of talented professionals. \r\n\r\nKun Shan has put emphasis on integrating school transportation, campus landscape and structures, department offices, regular classrooms and laboratories in order to provide a comfortable educational environment. As for the integration of college buildings, they have been remodeled to accommodate five colleges: The College of Engineering, The College of Business and Management, The College of Humanities, The College of Creative Media, and The College of Information and Technology. The total of all the students about fourteen thousand,teaching and administrative staff about five hundred and more people.\r\n\r\nExisting college department\r\n1.Research institude： \r\n■Doctoral program：machinery and energy engineering research institute\r\n■Master's program：electronic engineering research institute,electronic machinery engineering research institute,machinery engineering research institute, environment engineering research institute ,enterprise management research institute, visual transmission design institute, media art institute, informaion management institue, digital living science and technology institute, optoelectronics engineering institute, green material institute\r\n■In-serivce program：electronic engineering research institute, electronic machinery engineering research institute, machinery engineering research institute, environment engineering research institute, enterprise management research institute, visual transmission design institute, digital living science and technology institute.\r\n2.Regular session： \r\n■Four-year college of technology：21department for a group\r\n■Two-year college of technology：1 department\r\n3.Evening session ： \r\n■Two-year college of technology：8 department(在職班)\r\n■Four-year college of technology：20 department(在職班)\r\n■Two-year college of technology：8 department(在職專班)\r\n■Four-year college of technology：3 department(在職專班)\r\n■Two-year college of technology：11 department(extension course institute)\r\n4.Two year進修專校： \r\n■11 department\r\nOver the past 43 years, Kun Shan University has been a facilitator in the creation of that economic miracle for the nation while at the same time continuously adapting, growing, and improving itself. \r\n\r\nWhile marching into twenty-first century and facing the various changes happening around the globe and the nation, technological and vocational education will encounter new challenges. This university became well established and independent within thirty years. Kun Shan University has remained focused in the midst of tremendous challenges. Our mission is to maintain an international vision along with high educational standards with a view to integrate both a technological education and the humanities in order to develop innovative technical professionals.", "logo_small": "logos/KSU_80e4449f98fbb11da2a23930b0d11e40.jpg", "logo_small_url": "http://www.ocwconsortium.org/media/logos/KSU_80e4449f98fbb11da2a23930b0d11e40.jpg"}