{"id": 511, "name": "SASAC Education and Training Centre Education Network", "membership_type": "Organizational Members", "membership_status": "Current", "associate_consortium": "", "display_name": "SASAC Education and Training Centre Education Network", "main_website": "http://www.tcsasac.com/", "ocw_website": "", "description": "Education and Training Centre for Officials and Entrepreneurs of the State-owned Assets Supervision and Administration Commission of the State Council of the People’s Republic of China, also named SASAC Branch of Party School of the Central Committee of Communist Party of China (hereinafter referred to as ETCOE, SASAC) is a functionary organisation directly subordinating to SASAC.  It is responsible for the organisation and implementation of education and training programmes for staffs in SASAC system, and it provides education and training services for the businessmen and managers of the state-owned enterprises (SOE) and the functionaries of SASAC and the subordinate organisations.\r\n\r\nThe main bodies of trainees are:  leaders and backup executives of the central SOEs;  major leaders of the second-level subsidiaries of the central SOEs;  executives of the SOEs under the supervision and administration of the provincial SASACs;  other middle and high level executives, backbone business men and technical workers;  and the functionaries above division-director level of the SASAC departments, subordinate organisations and associations.\r\n\r\nThe scope of our training:  training programmes undertaken at SASAC Branch of Party School of the Central Committee of CPC, training programmes on business management, and on professional and technical skills. The key training programmes we have run are:  Training Programmes for the Young Cardres at SASAC Branch of Party School of the Central Committee of CPC;  Refresher Course for Cardres at Deputy-director Level;  Refresher Course for Cardres at Division-director Level;  Training Programmes for Leaders of the Central SOEs;  Training Programme for CFOs of the Central SOEs;  Special Training Programmes on the Topics Significant to SASAC work;  Overseas Training Programmes for the middle and high level executives of SOEs;  EMBA programmes and Long Distance Education Programmes for the middle and high level executives of SOEs;  organisation of forums and seminars on business management.", "logo_small": "", "logo_small_url": "http://www.ocwconsortium.org/media/"}