{"id": 515, "name": "National Pingtung University of Science and Technology", "membership_type": "Institutional Members - MRC", "membership_status": "Current", "associate_consortium": "TOCWC", "display_name": "National Pingtung University of Science and Technology", "main_website": "http://www.npust.edu.tw/index.aspx", "ocw_website": "", "description": "National Pintung University of Science and Technology (hereinafter referred to as “NPUST”) is in NeiPu, Pingtung County; behind is Mountain DaWu and beside runs Donggang River. Its campus is 298 hectares. These make NPUST the biggest and the prettiest university in Taiwan. In the campus, green lawn is grown, various trees and flowers planted. Dormitories were designed and built under the concern of the height difference of the land. They look simple and dedicate. The campus is filled with elegance and wabi sabi, comparing to a nature park. Up to academic year 2000, 36 institutes and departments have been established, offering undergraduate, MA, and PhD programs. Each of them is categorized under these 5 different colleges, which are College of Agriculture, College of Engineering, College of Management, and College of Humanities and Social Science. We have 372 full-time teachers, more than 10 thousand students. NPUST is with sound development in all institutes and departments and with rich study references and resources in each field. Moreover, with a library storing all kinds of books and references, and good experiment instruments for teaching, NPUST becomes the best place for students to study, to cultivate their personality, and to grow strong physically and mentally; for teachers, it is the most ideal place to do their research and teaching.\r\nNPUST locates at the transitional zone of tropical and subtropical area. Moreover, the history from setting up “Pingtung Extension School” in 1924 till now is the more-than-80-year experience in agriculture knowledge background. NPUST regards “Tropical Agriculture” as developing features and major principal.  It also aims at 6 topics, including “ecology and precaution against calamities, bio-tech based medical science of Agriculture, green energy, culture invention, industry innovation and management, and free software” With these topics, NPUST can collaborate with “Pingtung Agricultural Biotechnology Park” and “South Taiwan Science Park” to create a green silicon valley in South Taiwan.\r\nFor students to access to learning resources more easily, especially on this big campus, we have been actively set into action to install and improve Moodle system, an e-learning platform, to be a channel for communication among teachers and students regarding courses and teaching and a self-learning channel for students. We identify the concept of Taiwan Opencourseware Consortium Institution. Through this platform, we hope that we can share our achievement in high quality courses or programs at NPUST. With the shared ones of other members of this Institution, we also expect that this mechanism can inspire teachers and make them reflect on their teaching courses and improve it.", "logo_small": "logos/NPUST_b0c48f61cb0f7d52e85e49de55b742f2.jpg", "logo_small_url": "http://www.ocwconsortium.org/media/logos/NPUST_b0c48f61cb0f7d52e85e49de55b742f2.jpg"}