{"id": 53, "name": "Universidad Politécnica de Valencia", "membership_type": "Institutional Members - MRC", "membership_status": "Current", "associate_consortium": "", "display_name": "Universidad Politécnica de Valencia", "main_website": "http://www.upv.es", "ocw_website": "http://ocw.upv.es", "description": "The Universidad Politecnica de Valencia, Spain  (UPV) is a public educational and research institution. It has three campus sites: Valencia, Alcoi and Gandia, with a total of over 35,000 students, 2,600 faculty and research staff, and 1,900 administrative and services staff.\r\nThe UPV is a young institution. Its history dates back to the early 70s although some of its schools, such as the School of Design Engineering, the Higher Polytechnic School of Alcoy and the Faculty of Fine Arts, are over a hundred years old. \r\nThe UPV is composed of 10 schools and 3 faculties, where a total of 58 degrees are awarded. The current offer of postgraduate studies consist of 44 Masters  and 25 Doctor degrees.\r\nThe vision of the University is: \r\nIs a University that attracts the best students and trains professionals with a recognised, prestigious level of excellence which is highly valued by local and international employers. \r\nThe relevance of research outputs underpins the strong international presence of the institution, which has close collaborative links with the best universities in the world. \r\nUPV is an innovative and entrepreneurial University, with effective mechanisms for the dissemination of scientific and technological results, and which excels in the training of researchers and in the creation of technology-based companies. \r\nIs an efficient public institution at the service of society, with a strong social and environmental commitment. \r\nUPV is an innovative University at the service of society and its progress. Is an outstanding institution in research and in training professionals.", "logo_small": "logos/logo3_upv_539cb0f86a3923e8db7c4fddda9e1f28.jpg", "logo_small_url": "http://www.ocwconsortium.org/media/logos/logo3_upv_539cb0f86a3923e8db7c4fddda9e1f28.jpg"}