{"id": 550, "name": "Universitat Politècnica de Catalunya. BarcelonaTech (UPC)", "membership_type": "Institutional Members - MRC", "membership_status": "Current", "associate_consortium": "UNIVERSIA", "display_name": "Universitat Politècnica de Catalunya. BarcelonaTech (UPC)", "main_website": "http://www.upc.edu", "ocw_website": "http://ocw.upc.edu", "description": "*Description:\r\nThe Universitat Politècnica de Catalunya. BarcelonaTech (UPC) is a public institution dedicated to higher education and research, specialised in the fields ofengineering, architecture and science.\r\n\r\nIn a highly creative context, the UPC's research, teaching and management projects are based on the principles of freedom, justice, democracy, solidarity, cooperation, sustainability, efficiency, transparency and social responsibility. They also reflect the University's commitment to the environment and to change.\r\n\r\nWith a focus on intellectual rigor, critical thinking, a transversal approach to knowledge, educational innovation and entrepreneurship, the UPC produces competent professionals with the skills they need to tackle present and future challenges.\r\n\r\nThe activity that goes on at UPC campuses and schools has made the University a benchmark institution. The University harnesses the potential of basic and applied research, and transfers technology and knowledge to society. These actions make the UPC—in partnership with the productive fabric—an agent and driver of economic and social change.\r\n\r\nThe Universitat Politècnica de Catalunya. BarcelonaTech (UPC) puts its scientific and technological infrastructure at the service of research groups and centres, researchers and students, professionals, companies and institutions.\r\n\r\nAs a leading member of international networks of excellence, the UPC has a privileged relationship with global scientific and educational organisations. As a result, the University is at an advantage when it comes to attracting international talent.", "logo_small": "logos/UPC-positiu-p3005_70ac127db5d3ffae7e48989dc9a60bbc.png", "logo_small_url": "http://www.ocwconsortium.org/media/logos/UPC-positiu-p3005_70ac127db5d3ffae7e48989dc9a60bbc.png"}