{"id": 558, "name": "University of Leuven (KU Leuven) ", "membership_type": "Institutional Members", "membership_status": "Current", "associate_consortium": "", "display_name": "University of Leuven (KU Leuven) ", "main_website": "http://www.kuleuven.be", "ocw_website": "http://ocw.kuleuven.be", "description": "KU Leuven is an autonomous university. It was founded in 1425. It was born of and has grown within the Catholic tradition. From its Christian view of the world and the human, KU Leuven endeavours to be a place for open discussion of social, philosophical and ethical issues and a critical centre of reflection in and for the Catholic community.\r\n\r\nKU Leuven offers its students an academic education based on high-level research, with the aim of preparing them to assume their social responsibilities.\r\n\r\nKU Leuven is a research-intensive, internationally oriented university that carries out both fundamental and applied research.  It is strongly inter- and multidisciplinary in focus and strives for international excellence. To this end, KU Leuven works together actively with its research partners at home and abroad.\r\n\r\nKU Leuven encourages personal initiative and critical reflection in a culture of idea exchange, cooperation, solidarity and academic freedom. It pursues a proactive diversity policy for its students and staff.\r\n\r\nKU Leuven aims to actively participate in public and cultural debate and in the advancement of a knowledge-based society. It puts its expertise to the service of society, with particular consideration for its most vulnerable members.\r\n\r\nFrom a basis of social responsibility and scientific expertise, KU Leuven provides high-quality, comprehensive health care, including specialised tertiary care, in its University Hospitals. In doing so it strives toward optimum accessibility and respect for all patients.\r\n\r\nKU Leuven carries out its academic activities at various campuses, research parks and hospital facilities in close cooperation with the members of the KU Leuven Association and with its hospital partners.", "logo_small": "", "logo_small_url": "http://www.ocwconsortium.org/media/"}