{"id": 573, "name": "Pontifical Catholic University of Rio de Janeiro - PUC Rio", "membership_type": "Institutional Members - DC", "membership_status": "Current", "associate_consortium": "", "display_name": "Pontifical Catholic University of Rio de Janeiro - PUC Rio", "main_website": "http://www.puc-rio.br/index.html", "ocw_website": "http://condigital.ccead.puc-rio.br/condigital/", "description": "Recognized worldwide as one of the most important doctoral research centers in the country, the Pontifícia Universidade Católica do Rio de Janeiro (PUC-Rio) was founded in 1940 with the objective of developing knowledge based on humanistic values. The university now has 20,000 students who come from a variety of religious, ethnic and social backgrounds.\r\nIn the Campus we can find: a complete infrastructure and natural beauty and is located in a pleasant and quiet neighborhood. We have large libraries with access to over 500,000 titles;\r\nFREE Internet access provided (broadband and wireless);Restaurants, cafeterias, bookstores and ATMs on campus;Community service projects with underprivileged population and a cultural center with art exhibitions throughout the year.\r\n\r\nWe are divided in Academic Centers:\r\n\r\nCenter for Theology and Human Sciences (CTCH):\r\nArts and Design (Product Development, Digital Media and Fashion), Education, Language and Literature (Modern Languages, Literature, Linguistics, Translation, Creative Writing, Performing Arts), Pedagogy, Philosophy, Psychology and Theology. \r\n\r\nCenter for Social Sciences (CCS):\r\nBusiness, Economics, Law, Communications (Journalism, Publicity and Cinema), Geography and Environment, History, Social Service, Sociology Social Sciences and International Relations. \r\n\r\nCenter for Science and Technology (CTC):\r\nPhysics, Chemistry, Mathematics, Computer Science and Engineering (Chemical, Petroleum, Control and Automation, Civil, Materials and Metallurgy, Environmental, Computer, Electrical, Mechanical, Production and Nanotechnology). \r\n\r\nCenter for Biology and Medicine (CCBM): \r\nBiological Sciences \r\nGraduate courses held at specialized off-campus clinics. \r\n\r\nInterdisciplinary courses: \r\nArchitecture and Urban Studies, Environmental Engineering, and independent research institutes and projects, such as the Center for Telecommunications Studies (CETUC), Business School (IAG) and the Genesis Institute (Entrepreneurship Center and Trainee Program).\r\n\r\nAll departments offer:\r\nUndergraduate courses: Bachelor’s degree  \r\nGraduate courses: Master’s and Doctorate\r\n\r\nThe International Programs Office is responsible for agreements of international cooperation that permit the exchange of graduate and undergraduate students, scientific publications, joint research and exchange of faculty and researchers.\r\n\r\nThe Central Coordination for Distance Learning – CCEAD PUC-Rio – coordinates, supports and promotes  the activities of Distance Learning at the University, making possible the growth of virtual learning communities with the same characteristics of excellence found in the practices and traditions of the Catholic University (PUC) of Rio.", "logo_small": "logos/logoCCEAD_72dpi_d340f1d644f1275401c979f347b37922.jpg", "logo_small_url": "http://www.ocwconsortium.org/media/logos/logoCCEAD_72dpi_d340f1d644f1275401c979f347b37922.jpg"}