{"id": 577, "name": "OCWFrance", "membership_type": "Associate Consortium Members", "membership_status": "Current", "associate_consortium": "", "display_name": "OCWFrance", "main_website": "http://www.universites-numeriques.fr/ocw", "ocw_website": "", "description": "CERIMES (Centre de ressources et d'information sur les multimédias pour l'enseignement supérieur): Centre of resources and information about multimedia for higher education\r\n\r\nFounded by a decree of August 17th, 2005, CERIMES succeeds SFRS, Service of films of scientific\r\nresearch, which was created in 1954. \r\n\r\nIt is a service of the French Ministry of higher education and research.\r\n\r\nCERIMES aims are:\r\n\r\na) To facilitate the access of teachers, researchers and students of higher education to multimedia\r\nresources and help them to integrate them into education;\r\nb) Co-produce audiovisual or multimedia materials at the request of teachers and researchers;\r\nc) Inform about e-learning, specifically for distance learning in higher education.\r\n\r\nMain actions of the CERIMES:\r\n\r\nPublisher and Manager of Canal-U (digital video library for higher education and research -\r\nwww.canal-u.fr; Publisher and Manager of Formasup, www.formasup.education.fr/ the catalogue of\r\ndistance training in French higher education; Publisher and Manager of the portal of the UNT ((Universités Numériques Thématiques ≈ digital thematic universities) http://www.universitesnumeriques.fr/; Publisher and Manager of http://www.signets-universites.fr/ ; Publisher and Manager of http://bibnum.education.fr/ fundamental scientific texts with commentaries by contemporary scientists and CERIMES also offers services of an image library. CERIMES coproduces audiovisual and multimedia documents, mainly for the UNT (Universités Numériques Thématiques ≈ digital thematic universities). Their annual reports, in French, are on line:\r\nhttp://www.cerimes.fr/le-cerimes/rapports-dactivite.html", "logo_small": "", "logo_small_url": "http://www.ocwconsortium.org/media/"}