{"id": 595, "name": "National Ilan University", "membership_type": "Institutional Members - MRC", "membership_status": "Current", "associate_consortium": "TOCWC", "display_name": "National Ilan University", "main_website": "http://www.niu.edu.tw/newniu/index.php", "ocw_website": "http://ocw.niu.edu.tw/moodle/", "description": "As a renowned university in Taiwan, National Ilan University seeks to achieve the highest spirits of academics, practical exercise, dedication, and interpersonal connections by stressing the importance of both teaching and research as well as striking the balance between humanities and sciences, creating a student body equipped with professional knowledge, skills abundant literacy of humanities, and proactive social concerns and international perspectives.\r\n\r\n         We hope to establish University philosophies shaped by strict institutionalization stipulated by the University President, dedicated efforts by the faculty to teaching, manifestation of learning assiduity, devotion by the administrative staff, and contribution from alumni in the hopes of realizing the goal of  the“3E”—academic excellence, administrative efficiency, and equity of policy making.\r\n\r\n         To be a training ground for future leaders, the long-term sustainable goals of NIU in academics and research can be in concise terms as follows:\r\n\r\n    Perpetual results of academic excellence and vying for external resources for high-quality education.\r\n    Promotion of holistic education to facilitate academics.\r\n    Reinforcement of integrated research resources to strengthen prevailing academic programs.\r\n    Encouragement of academic exchange with sufficient quality and quantity at both domestic and international levels.\r\n    Corroboration of NIU humanity literacy based on humanity and guided by science.\r\n    Establishment of an administrative culture that is congruent with the faculty and students andfacilitates policy decision making through communication, mutual-trust and collaboration.\r\n    Recruitment of top-notch faculty members and outstanding students.\r\n    Enlargement of finance through education cooperation events, fundraising, and various other channels.", "logo_small": "", "logo_small_url": "http://www.ocwconsortium.org/media/"}