{"id": 599, "name": "Universidad Internacional de la Rioja - UNIR", "membership_type": "Institutional Members - MRC", "membership_status": "Pending", "associate_consortium": "UNIVERSIA", "display_name": "Universidad Internacional de la Rioja - UNIR", "main_website": "http://www.unir.net", "ocw_website": "", "description": "International University of La Rioja (UNIR, www.unir.net, Spain) is a young online university founded on a global vision of education directly linked to companies and business. UNIR facilitates an exclusive, innovative and high quality virtual model of higher education, which leans on a personalized, pro-active, and collaborative online learning methodology for learning and teaching.\r\n\r\nUNIR is an academic institution established in compliance with the current regulations governing universities (100% open university), fulfilling all parameters and regulations of the European Higher Education Area (EHEA).\r\n\r\nUNIR provides international courses, in two languages (English and Spanish), and comprises an academic community of over 300 highly knowledgeable lecturers across the world, along with a strong team of more than 400 multidisciplinary professionals, working on R&D projects and support services (i.e. tutoring, legal, publishing, editing, technical, administrative, etcetera).  Student number keeps increasing exponentially, surpassing this academic year the nine thousands (ratio of 1 support staff/20 students; 1 lecturer/20 students).  UNIR has premises in Spain (Logroño and Madrid), Argentina (Buenos Aires), and Bolivia (Santa Cruz), and a number of collaboration agreements with Latin American universities.\r\n\r\nResearch at UNIR covers the various scientific and humanistic fields of study (i.e. Communication, Social Science, Education, et cetera), with particular emphasis on the information and communication technologies (ICT) applied to education (Technology-Enhanced Learning).\r\n\r\nUNIR develops various programs and research lines within the framework of the Spanish National R&D&i Plan 2008-2011, as well as within those of the EU 7th Framework Programme.", "logo_small": "", "logo_small_url": "http://www.ocwconsortium.org/media/"}