{"id": 62, "name": "ESAGS -Escola Superior de Administração e Gestão", "membership_type": "Institutional Members - DC", "membership_status": "Current", "associate_consortium": "", "display_name": "ESAGS -Escola Superior de Administração e Gestão", "main_website": "http://www.esags.edu.br/", "ocw_website": "http://www.esags.edu.br/", "description": "ESAGS - Escola Superior de Administracao e Gestao (Administration and Management School) is a private, undergraduate institution fostered by CESS - Centro de Ensino Superior Strong (Strong Undergraduate Center) founded on July 05, 2000.\r\nCESS aims to create undergraduate courses, sequential courses and other high-quality educational activities. Its mission targets the preparation of professionals that bear a broad, local and global view to achieve citizenship and apply various competences and capabilities within our society. Moreover, it aims to supply students with tools for self development on a holistic basis, with self-accomplishment so that they become critical and thoughtful thinkers with a multidiscipline and generalist view. These students are expected to be active social agents for changes. They are thought to be entrepreneurs that understand the constant updating contexts derived from the consolidation of new businesses.\r\nAlong with its teaching background activity, ESAGS aims to implement studies and researches on such scientific and technical knowledge branch. It also aims to serve the community through the support of private companies and public organs. The maintenance of cultural and technical exchange with scientific and university-based centers in Brazil is another role played by ESAGS.  ESAGS has two campuses: one settled in Santo Andre (metropolitan region of Sao Paulo city), and the other in Santos (coastal city in Sao Paulo State).", "logo_small": "logos/logo_esags_site_02d9978a65a07c4c92102d184ef7d799.png", "logo_small_url": "http://www.ocwconsortium.org/media/logos/logo_esags_site_02d9978a65a07c4c92102d184ef7d799.png"}