{"id": 75, "name": "National Chengchi University", "membership_type": "Institutional Members - MRC", "membership_status": "Current", "associate_consortium": "TOCWC", "display_name": "National Chengchi University", "main_website": "http://www.nccu.edu.tw/", "ocw_website": "http://ocw.nccu.edu.tw/", "description": "Established in 1927, National Chengchi University (NCCU) is noted for its humanities and social sciences disciplines and currently housing 9 colleges, including liberal arts, science, social sciences, law, commerce, foreign languages & literature, communication, international affairs and education; 33 departments, 2 BA modules (Undergraduate Program in European Languages and College of Communication Undergraduate Degree Program), and 48 graduate institutes (including master’s module), with 32 graduate institutes offering PhD programs, 16 on-the-job master’s programs, and 5 English-taught degree programs (International Master’s Program in Taiwan Studies, International Master’s Program in China Studies, International Master of Business Administration, International Master’s Program in International Communication Studies, and International Doctor Program in Asia-Pacific Studies).\r\n\r\nPublic and Business Administration Education Center, Social Sciences Materials Center, Computer Center, Center of International Education and Exchange, Center for Teaching and Learning Development, the Institute of International Relations, Election Study Center, Center for the Third Sector, Center for Creativity and Innovation Studies, Center for China Studies, Taiwan Studies Center, Center for Science, Technology and Human Values, Research Center for Mind, Brain and Learning, and Center for Aboriginal Studies are affiliated to the University. In addition, NCCU also has an affiliated high school, an experimental elementary school and kindergarten, by which NCCU forms a consistent and articulated education system beginning at the pre-school level and continuing all the way to the Ph. D program. There are more than 15000 students, 600 full-time teachers and 40 research fellows at NCCU. \r\n\r\nIn the future, NCCU will pass on the outstanding traditions of humanities and social sciences, balancing both teaching and research, theory and practice, internationalization and domestication in academic disciplines including humanities, social sciences, law, business and communications, reinforce dialogues between humanities, technology and society, and promote multi-variant academic research development. Our vision is to build a first-rate international humanities and social sciences academic temple, and nurture “Humane, Global, Innovative” successors for the new century.", "logo_small": "logos/nccu_logo72dpi_53e7daf1fdc9c068a4cfa115a767a148.jpg", "logo_small_url": "http://www.ocwconsortium.org/media/logos/nccu_logo72dpi_53e7daf1fdc9c068a4cfa115a767a148.jpg"}