{"id": 9, "name": "Fundação Getulio Vargas - FGV Online", "membership_type": "Institutional Members - DC", "membership_status": "Sustaining", "associate_consortium": "", "display_name": "Fundação Getulio Vargas - FGV Online", "main_website": "http://www.fgv.br/", "ocw_website": "http://www5.fgv.br/fgvonline/CursosGratuitos.aspx", "description": "Being the first institution in Latin America to create graduation courses in Public and Business Administration, FGV graduated in the middle of the 50's the first classes of business administration in the region, at the then existing Brazilian Public Administration School (formerly known as EBAP, currently EBAPE) and the Sao Paulo Business School (EAESP). Currently, these two units and all the others that belong to the Foundation's universe, perpetuate this tradition at their graduation courses in administration and economy, as well as post-graduation courses such as in Social Sciences and Law.\r\n\r\nIts schools, in various regions of the country, are recognized also abroad, maintaining joint programs with important institutions, as well as advanced teaching centers. FGV's masters and doctor's degree programs accredit their students to be accepted as scholars or professors in the most demanding universities in the world. The lato sensu courses at FGV encompass a broad selection of programs, aimed at professionals searching for specialization and academic improvement, who benefit largely from the approval by the market.\r\n\r\nIts main areas of work and Schools are:\r\nEBAPE - Brazilian School of Public and Business Administration - 1952\r\nEAESP - Sao Paulo Business School - 1954\r\nEPGE - Post-Graduation School in Economics - 1960\r\nFGV PROJETOS - Consulting - 1970\r\nCPDOC - Center for Research and Contemporary Historical Documentation of Brazil - 1973\r\nFGV PRESS - 1974\r\nDIREITO RIO - Rio de Janeiro Law School - 2002\r\nEDESP - Sao Paulo Law School - 2002\r\nEESP - Sao Paulo School of Economics - 2003\r\nIDE - Educational Development Institute - 2003\r\n\tFGV Management - develops, implements and manages distribution of MBA courses through a network of affiliates in 80 cities around Brazil\r\n\tFGV Online - Distance Education\r\n\tCorporative Courses - in-company courses for executives development\r\n\tCertification  - Quality assurance for undergraduate programs\r\n\r\nFGV Online \r\nThe flexibility of time and place is one of the most important advantages of the online courses offered by FGV, neutralizing barriers such as time and distance. But there are other advantages, such as the development of self established timing compatible with each student's needs, the employment of a case method system, focused in the Brazilian reality, as well as the easy access to the knowledge resources schools and other units at FGV and the reductions of costs and efficiency gains.\r\n\r\nThe FGV professors elaborate the content of the courses, in several areas. The most relevant concepts of the program are supported by audiovisual content, animations and games. The use of different multimedia resources optimizes the interactions between the student and the professor, contributing to the knowledge building process.\r\n\r\nRecently, two courses of FGV Online were awarded by EFMD – the European Foundation for Management Development  - with CEL, the Programme accreditation for Technology-Enhanced Learning: Executive Master in Business Administration and the Undergraduate Course in Process Management.", "logo_small": "logos/FGV_Quad_1e428eb1cf375000498df583e0c91cc4.JPG", "logo_small_url": "http://www.ocwconsortium.org/media/logos/FGV_Quad_1e428eb1cf375000498df583e0c91cc4.JPG"}